TexasInstruments/f29h85x-sdk/source/driverlib/inc/hw_elt.h
//*************************************************************************************************
//
// The following are defines for the bit fields in the ELTMUXSEL22 register
//
//*************************************************************************************************
#define ELT_MUXSEL22_MUXSEL_S   0U
#define ELT_MUXSEL22_MUXSEL_M   0x1FFU   // MUX Select

//*************************************************************************************************
//
// The following are defines for the bit fields in the ELTMUXSEL23 register
//
//*************************************************************************************************
#define ELT_MUXSEL23_MUXSEL_S   0U
#define ELT_MUXSEL23_MUXSEL_M   0x1FFU   // MUX Select

//*************************************************************************************************
//
// The following are defines for the bit fields in the ELTMUXSEL24 register
//
//*************************************************************************************************
#define ELT_MUXSEL24_MUXSEL_S   0U
#define ELT_MUXSEL24_MUXSEL_M   0x1FFU   // MUX Select

//*************************************************************************************************
//
// The following are defines for the bit fields in the ELTMUXSEL25 register
//
//*************************************************************************************************
#define ELT_MUXSEL25_MUXSEL_S   0U
#define ELT_MUXSEL25_MUXSEL_M   0x1FFU   // MUX Select

//*************************************************************************************************
//
// The following are defines for the bit fields in the ELTMUXSEL26 register
//
//*************************************************************************************************
#define ELT_MUXSEL26_MUXSEL_S   0U
#define ELT_MUXSEL26_MUXSEL_M   0x1FFU   // MUX Select

//*************************************************************************************************
//
// The following are defines for the bit fields in the ELTMUXSEL27 register
//
//*************************************************************************************************
#define ELT_MUXSEL27_MUXSEL_S   0U
#define ELT_MUXSEL27_MUXSEL_M   0x1FFU   // MUX Select

//*************************************************************************************************
//
// The following are defines for the bit fields in the ELTMUXSEL28 register
//
//*************************************************************************************************
#define ELT_MUXSEL28_MUXSEL_S   0U
#define ELT_MUXSEL28_MUXSEL_M   0x1FFU   // MUX Select

//*************************************************************************************************
//
// The following are defines for the bit fields in the ELTMUXSEL29 register
//
//*************************************************************************************************
#define ELT_MUXSEL29_MUXSEL_S   0U
#define ELT_MUXSEL29_MUXSEL_M   0x1FFU   // MUX Select

//*************************************************************************************************
//
// The following are defines for the bit fields in the ELTMUXSEL30 register
//
//*************************************************************************************************
#define ELT_MUXSEL30_MUXSEL_S   0U
#define ELT_MUXSEL30_MUXSEL_M   0x1FFU   // MUX Select

//*************************************************************************************************
//
// The following are defines for the bit fields in the ELTMUXSEL31 register
//
//*************************************************************************************************
#define ELT_MUXSEL31_MUXSEL_S   0U
#define ELT_MUXSEL31_MUXSEL_M   0x1FFU   // MUX Select



#endif
